In [1]:
from utils.schedule_utils import load_data_split,table_to_str,table_to_str_sql,find_intersection_and_add_row_id,Prepare_Data_for_Operator_Sequence,format_document,batch_rerank_scores,ROLLBACK,merge_clean_and_format_df_dict,retrieve_rows_by_subtables,process_error_analysis_list
import pickle
import numpy as np
import pandas as pd
import os
import json
from FlagEmbedding import FlagReranker
from tqdm import tqdm
from typing import Dict, Any
from utils.evaluator import Evaluator
from utils.prompt_generate import build_wikitq_prompt_from_df,evaluate_predictions,filter_dataframe_from_responses,fix_sql_query,match_subtables,retrieve_rows_by_subtables,build_tab_fact_prompt_from_df
from utils.async_llm import infer_prompts

/home/aizoo/miniconda3/envs/hstar/lib/python3.9/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]

In [ ]:
## wikitq: 0.491 second/query 
## tab_fact: 0.29 second/query

In [2]:
from vllm import LLM, SamplingParams
from transformers import AutoTokenizer
import pandas as pd
import numpy as np
from time import sleep
import argparse
from vllm.lora.request import LoRARequest
import json
from tqdm import tqdm
import os

INFO 10-22 01:36:40 [__init__.py:216] Automatically detected platform cuda.

In [3]:
os.environ['VLLM_ATTENTION_BACKEND'] = 'FLASH_ATTN'

In [3]:
llm_path = '/data/workspace/yanmy/models/Qwen3-4B-Instruct-2507'
# llm_path = '/data/workspace/yanmy/models/Qwen2.5-7B-Instruct/'
llm = LLM(model=llm_path,
        tensor_parallel_size=2,
        # enforce_eager=True,
        enable_chunked_prefill=True,
        max_model_len=23000,
        # num_scheduler_steps=10,
        enable_prefix_caching=True,
        gpu_memory_utilization = 0.85,
        max_num_seqs=256,
        # kv_cache_dtype='fp8'
        )

tokenizer = AutoTokenizer.from_pretrained(llm_path)

INFO 10-20 22:36:24 [utils.py:233] non-default args: {'max_model_len': 23000, 'tensor_parallel_size': 2, 'enable_prefix_caching': True, 'gpu_memory_utilization': 0.85, 'max_num_seqs': 256, 'disable_log_stats': True, 'enable_chunked_prefill': True, 'model': '/data/workspace/yanmy/models/Qwen3-4B-Instruct-2507'}
INFO 10-20 22:36:24 [model.py:547] Resolved architecture: Qwen3ForCausalLM

`torch_dtype` is deprecated! Use `dtype` instead!

INFO 10-20 22:36:24 [model.py:1510] Using max model len 23000

INFO 10-20 22:36:24 [scheduler.py:205] Chunked prefill is enabled with max_num_batched_tokens=8192.
(EngineCore_DP0 pid=1870096) INFO 10-20 22:36:25 [core.py:644] Waiting for init message from front-end.
(EngineCore_DP0 pid=1870096) INFO 10-20 22:36:25 [core.py:77] Initializing a V1 LLM engine (v0.11.0) with config: model='/data/workspace/yanmy/models/Qwen3-4B-Instruct-2507', speculative_config=None, tokenizer='/data/workspace/yanmy/models/Qwen3-4B-Instruct-2507', skip_tokenizer_init=False, tokenizer_mode=auto, revision=None, tokenizer_revision=None, trust_remote_code=False, dtype=torch.bfloat16, max_seq_len=23000, download_dir=None, load_format=auto, tensor_parallel_size=2, pipeline_parallel_size=1, data_parallel_size=1, disable_custom_all_reduce=False, quantization=None, enforce_eager=False, kv_cache_dtype=auto, device_config=cuda, structured_outputs_config=StructuredOutputsConfig(backend='auto', disable_fallback=False, disable_any_whitespace=False, disable_additional_properties=False, reasoning_parser=''), observability_config=ObservabilityConfig(show_hidden_metrics_for_version=None, otlp_traces_endpoint=None, collect_detailed_traces=None), seed=0, served_model_name=/data/workspace/yanmy/models/Qwen3-4B-Instruct-2507, enable_prefix_caching=True, chunked_prefill_enabled=True, pooler_config=None, compilation_config={"level":3,"debug_dump_path":"","cache_dir":"","backend":"","custom_ops":[],"splitting_ops":["vllm.unified_attention","vllm.unified_attention_with_output","vllm.mamba_mixer2","vllm.mamba_mixer","vllm.short_conv","vllm.linear_attention","vllm.plamo2_mamba_mixer","vllm.gdn_attention","vllm.sparse_attn_indexer"],"use_inductor":true,"compile_sizes":[],"inductor_compile_config":{"enable_auto_functionalized_v2":false},"inductor_passes":{},"cudagraph_mode":[2,1],"use_cudagraph":true,"cudagraph_num_of_warmups":1,"cudagraph_capture_sizes":[512,504,496,488,480,472,464,456,448,440,432,424,416,408,400,392,384,376,368,360,352,344,336,328,320,312,304,296,288,280,272,264,256,248,240,232,224,216,208,200,192,184,176,168,160,152,144,136,128,120,112,104,96,88,80,72,64,56,48,40,32,24,16,8,4,2,1],"cudagraph_copy_inputs":false,"full_cuda_graph":false,"use_inductor_graph_partition":false,"pass_config":{},"max_capture_size":512,"local_cache_dir":null}
(EngineCore_DP0 pid=1870096) WARNING 10-20 22:36:25 [multiproc_executor.py:720] Reducing Torch parallelism from 32 threads to 1 to avoid unnecessary CPU contention. Set OMP_NUM_THREADS in the external environment to tune this value as needed.
(EngineCore_DP0 pid=1870096) INFO 10-20 22:36:25 [shm_broadcast.py:289] vLLM message queue communication handle: Handle(local_reader_ranks=[0, 1], buffer_handle=(2, 16777216, 10, 'psm_b59b288d'), local_subscribe_addr='ipc:///tmp/44216407-a1a0-41f2-9e89-e2a756c5cb61', remote_subscribe_addr=None, remote_addr_ipv6=False)
(EngineCore_DP0 pid=1870096) INFO 10-20 22:36:27 [shm_broadcast.py:289] vLLM message queue communication handle: Handle(local_reader_ranks=[0], buffer_handle=(1, 10485760, 10, 'psm_471a6cba'), local_subscribe_addr='ipc:///tmp/af260b0c-f635-4216-bd74-47013af6db3c', remote_subscribe_addr=None, remote_addr_ipv6=False)
(EngineCore_DP0 pid=1870096) INFO 10-20 22:36:27 [shm_broadcast.py:289] vLLM message queue communication handle: Handle(local_reader_ranks=[0], buffer_handle=(1, 10485760, 10, 'psm_20eec283'), local_subscribe_addr='ipc:///tmp/3de36520-9d36-43bd-ad01-a5e05ebd5d32', remote_subscribe_addr=None, remote_addr_ipv6=False)
(EngineCore_DP0 pid=1870096) (EngineCore_DP0 pid=1870096) INFO 10-20 22:36:27 [__init__.py:1384] Found nccl from library libnccl.so.2
INFO 10-20 22:36:27 [__init__.py:1384] Found nccl from library libnccl.so.2
(EngineCore_DP0 pid=1870096) (EngineCore_DP0 pid=1870096) INFO 10-20 22:36:27 [pynccl.py:103] vLLM is using nccl==2.27.3
INFO 10-20 22:36:27 [pynccl.py:103] vLLM is using nccl==2.27.3
(EngineCore_DP0 pid=1870096) (EngineCore_DP0 pid=1870096) WARNING 10-20 22:36:27 [symm_mem.py:58] SymmMemCommunicator: Device capability 8.9 not supported, communicator is not available.
WARNING 10-20 22:36:27 [symm_mem.py:58] SymmMemCommunicator: Device capability 8.9 not supported, communicator is not available.
(EngineCore_DP0 pid=1870096) (EngineCore_DP0 pid=1870096) INFO 10-20 22:36:27 [custom_all_reduce.py:35] Skipping P2P check and trusting the driver's P2P report.
INFO 10-20 22:36:27 [custom_all_reduce.py:35] Skipping P2P check and trusting the driver's P2P report.
(EngineCore_DP0 pid=1870096) (EngineCore_DP0 pid=1870096) WARNING 10-20 22:36:27 [custom_all_reduce.py:154] Custom allreduce is disabled because your platform lacks GPU P2P capability or P2P test failed. To silence this warning, specify disable_custom_all_reduce=True explicitly.
WARNING 10-20 22:36:27 [custom_all_reduce.py:154] Custom allreduce is disabled because your platform lacks GPU P2P capability or P2P test failed. To silence this warning, specify disable_custom_all_reduce=True explicitly.
(EngineCore_DP0 pid=1870096) INFO 10-20 22:36:27 [shm_broadcast.py:289] vLLM message queue communication handle: Handle(local_reader_ranks=[1], buffer_handle=(1, 4194304, 6, 'psm_0c93b420'), local_subscribe_addr='ipc:///tmp/5f62c967-7ae4-4eab-9929-663bc8f4d231', remote_subscribe_addr=None, remote_addr_ipv6=False)
(EngineCore_DP0 pid=1870096) (EngineCore_DP0 pid=1870096) INFO 10-20 22:36:27 [__init__.py:1384] Found nccl from library libnccl.so.2
INFO 10-20 22:36:27 [__init__.py:1384] Found nccl from library libnccl.so.2
(EngineCore_DP0 pid=1870096) (EngineCore_DP0 pid=1870096) INFO 10-20 22:36:27 [pynccl.py:103] vLLM is using nccl==2.27.3
INFO 10-20 22:36:27 [pynccl.py:103] vLLM is using nccl==2.27.3
(EngineCore_DP0 pid=1870096) (EngineCore_DP0 pid=1870096) INFO 10-20 22:36:27 [parallel_state.py:1208] rank 0 in world size 2 is assigned as DP rank 0, PP rank 0, TP rank 0, EP rank 0
INFO 10-20 22:36:27 [parallel_state.py:1208] rank 1 in world size 2 is assigned as DP rank 0, PP rank 0, TP rank 1, EP rank 1
[Gloo] Rank [Gloo] Rank 0 is connected to 1 peer ranks. Expected number of connected peer ranks is : 11 is connected to 1 peer ranks. Expected number of connected peer ranks is :
1
[Gloo] Rank 0 is connected to 1 peer ranks. Expected number of connected peer ranks is : [Gloo] Rank 1
1 is connected to 1 peer ranks. Expected number of connected peer ranks is : 1
[Gloo] Rank 0 is connected to 0 peer ranks. Expected number of connected peer ranks is : [Gloo] Rank 0
0 is connected to 0 peer ranks. Expected number of connected peer ranks is : 0
[Gloo] Rank [Gloo] Rank 0 is connected to 0 peer ranks. Expected number of connected peer ranks is : 0
0 is connected to 0 peer ranks. Expected number of connected peer ranks is : 0
[Gloo] Rank 0 is connected to 0 peer ranks. Expected number of connected peer ranks is : 0
[Gloo] Rank 0 is connected to 0 peer ranks. Expected number of connected peer ranks is : 0
[Gloo] Rank 0 is connected to 1 peer ranks. Expected number of connected peer ranks is : 1[Gloo] Rank
1 is connected to 1 peer ranks. Expected number of connected peer ranks is : 1
(EngineCore_DP0 pid=1870096) WARNING 10-20 22:36:27 [topk_topp_sampler.py:66] FlashInfer is not available. Falling back to the PyTorch-native implementation of top-p & top-k sampling. For the best performance, please install FlashInfer.
(EngineCore_DP0 pid=1870096) WARNING 10-20 22:36:27 [topk_topp_sampler.py:66] FlashInfer is not available. Falling back to the PyTorch-native implementation of top-p & top-k sampling. For the best performance, please install FlashInfer.
(EngineCore_DP0 pid=1870096) (Worker_TP1 pid=1870120) INFO 10-20 22:36:27 [gpu_model_runner.py:2602] Starting to load model /data/workspace/yanmy/models/Qwen3-4B-Instruct-2507...
(EngineCore_DP0 pid=1870096) (Worker_TP0 pid=1870118) INFO 10-20 22:36:27 [gpu_model_runner.py:2602] Starting to load model /data/workspace/yanmy/models/Qwen3-4B-Instruct-2507...
(EngineCore_DP0 pid=1870096) (Worker_TP1 pid=1870120) INFO 10-20 22:36:28 [gpu_model_runner.py:2634] Loading model from scratch...
(EngineCore_DP0 pid=1870096) (Worker_TP0 pid=1870118) INFO 10-20 22:36:28 [gpu_model_runner.py:2634] Loading model from scratch...
(EngineCore_DP0 pid=1870096) (Worker_TP1 pid=1870120) INFO 10-20 22:36:28 [cuda.py:366] Using Flash Attention backend on V1 engine.
(EngineCore_DP0 pid=1870096) (Worker_TP0 pid=1870118) INFO 10-20 22:36:28 [cuda.py:366] Using Flash Attention backend on V1 engine.

Loading safetensors checkpoint shards:   0% Completed | 0/3 [00:00<?, ?it/s]

(EngineCore_DP0 pid=1870096) (Worker_TP1 pid=1870120) INFO 10-20 22:36:29 [default_loader.py:267] Loading weights took 0.91 seconds
(EngineCore_DP0 pid=1870096) (Worker_TP0 pid=1870118) INFO 10-20 22:36:29 [default_loader.py:267] Loading weights took 0.95 seconds
(EngineCore_DP0 pid=1870096) (Worker_TP1 pid=1870120) INFO 10-20 22:36:29 [gpu_model_runner.py:2653] Model loading took 3.8657 GiB and 1.087936 seconds
(EngineCore_DP0 pid=1870096) (Worker_TP0 pid=1870118) INFO 10-20 22:36:29 [gpu_model_runner.py:2653] Model loading took 3.8657 GiB and 1.150435 seconds
(EngineCore_DP0 pid=1870096) (EngineCore_DP0 pid=1870096) (Worker_TP0 pid=1870118) (Worker_TP1 pid=1870120) INFO 10-20 22:36:37 [backends.py:548] Using cache directory: /home/aizoo/.cache/vllm/torch_compile_cache/6bf20df3c5/rank_0_0/backbone for vLLM's torch.compile
INFO 10-20 22:36:37 [backends.py:548] Using cache directory: /home/aizoo/.cache/vllm/torch_compile_cache/6bf20df3c5/rank_1_0/backbone for vLLM's torch.compile
(EngineCore_DP0 pid=1870096) (EngineCore_DP0 pid=1870096) (Worker_TP0 pid=1870118) (Worker_TP1 pid=1870120) INFO 10-20 22:36:37 [backends.py:559] Dynamo bytecode transform time: 7.12 s
INFO 10-20 22:36:37 [backends.py:559] Dynamo bytecode transform time: 7.11 s
(EngineCore_DP0 pid=1870096) (Worker_TP0 pid=1870118) INFO 10-20 22:36:44 [backends.py:197] Cache the graph for dynamic shape for later use
(EngineCore_DP0 pid=1870096) (Worker_TP1 pid=1870120) INFO 10-20 22:36:44 [backends.py:197] Cache the graph for dynamic shape for later use
(EngineCore_DP0 pid=1870096) (Worker_TP1 pid=1870120) INFO 10-20 22:37:08 [backends.py:218] Compiling a graph for dynamic shape takes 30.77 s
(EngineCore_DP0 pid=1870096) (Worker_TP0 pid=1870118) INFO 10-20 22:37:08 [backends.py:218] Compiling a graph for dynamic shape takes 30.77 s
(EngineCore_DP0 pid=1870096) (EngineCore_DP0 pid=1870096) (Worker_TP1 pid=1870120) (Worker_TP0 pid=1870118) INFO 10-20 22:37:26 [monitor.py:34] torch.compile takes 37.89 s in total
INFO 10-20 22:37:26 [monitor.py:34] torch.compile takes 37.89 s in total
(EngineCore_DP0 pid=1870096) (Worker_TP1 pid=1870120) INFO 10-20 22:37:27 [gpu_worker.py:298] Available KV cache memory: 14.64 GiB
(EngineCore_DP0 pid=1870096) (Worker_TP0 pid=1870118) INFO 10-20 22:37:27 [gpu_worker.py:298] Available KV cache memory: 14.64 GiB
(EngineCore_DP0 pid=1870096) INFO 10-20 22:37:28 [kv_cache_utils.py:1087] GPU KV cache size: 213,232 tokens
(EngineCore_DP0 pid=1870096) INFO 10-20 22:37:28 [kv_cache_utils.py:1091] Maximum concurrency for 23,000 tokens per request: 9.27x
(EngineCore_DP0 pid=1870096) INFO 10-20 22:37:28 [kv_cache_utils.py:1087] GPU KV cache size: 213,232 tokens
(EngineCore_DP0 pid=1870096) INFO 10-20 22:37:28 [kv_cache_utils.py:1091] Maximum concurrency for 23,000 tokens per request: 9.27x

Capturing CUDA graphs (mixed prefill-decode, PIECEWISE): 100%|██████████| 67/67 [00:04<00:00, 15.44it/s]
Capturing CUDA graphs (decode, FULL): 100%|██████████| 35/35 [00:01<00:00, 20.69it/s]

(EngineCore_DP0 pid=1870096) (Worker_TP1 pid=1870120) INFO 10-20 22:37:35 [gpu_model_runner.py:3480] Graph capturing finished in 7 secs, took 1.53 GiB
(EngineCore_DP0 pid=1870096) (Worker_TP0 pid=1870118) INFO 10-20 22:37:35 [gpu_model_runner.py:3480] Graph capturing finished in 7 secs, took 1.53 GiB
(EngineCore_DP0 pid=1870096) INFO 10-20 22:37:35 [core.py:210] init engine (profile, create kv cache, warmup model) took 65.39 seconds
INFO 10-20 22:37:35 [llm.py:306] Supported_tasks: ['generate']

In [4]:
def response_vllm(llm,all_instructions,sample_num: int):
    text_all = []
    # all_instructions = prompts_list
    for prompt in tqdm(all_instructions, desc="Formatting Prompts"):
        messages = [{"role": "user", "content": prompt}]
        text = tokenizer.apply_chat_template(
            messages,
            tokenize=False,
            add_generation_prompt=True
        )
        text_all.append(text)
    if sample_num == 1:
        sampling_params = SamplingParams(temperature=0, top_p=1, max_tokens=2048) 
    else:
        ## top_k/min_p 传不进去
        sampling_params = SamplingParams(n=sample_num, temperature=0.7, top_p=0.8, top_k=20, min_p=0, max_tokens=2048) 
    outputs = llm.generate(text_all, sampling_params)
    generation_list = []
    for output in tqdm(outputs, desc="Processing Outputs"):
        generated_text = [o.text for o in output.outputs]
        generation_list.append(generated_text)
    return generation_list

In [3]:
## 参数记录 for wikitq
N_PARALLEL = 32 ## only for convert_df_type_parallel.py of data preprocess，一次性离线的
# llm_path = '/data/workspace/yanmy/models/Qwen3-30B-A3B-Instruct-2507-FP8'
# llm_path = '/data/workspace/yanmy/models/Qwen3-4B-Instruct-2507'
llm_path = '/data/workspace/yanmy/models/Qwen2.5-7B-Instruct'
embedding_base_model_path = '/data/workspace/yanmy/models/bge-m3'
router_model_path = '/data/workspace/yanmy/HybridRAG/H-STAR/router/bge-m3-finetuned/' ## fine-tuned router model path
check_moedl_path = '/data/workspace/yanmy/HybridRAG/H-STAR/check/output/bge-reranker-v2-m3-finetuned/' ## check model path
# tmp_save_path = 'datasets/schedule_test/wikitq' ## 临时存储路径
tmp_save_path = 'datasets/schedule_test/wikitq_api_server_7B' ## 临时存储路径
dataset_name = 'wikitq'
split = 'test'
tau = 0.82
check_tau = 0.8
ALL_LABELS = [
    'Base', 'Select_Row', 'Select_Column', 'Execute_SQL', 'RAG_20_5', 
]

In [5]:
## 参数记录 for wikitq
N_PARALLEL = 32 ## only for convert_df_type_parallel.py of data preprocess，一次性离线的
embedding_base_model_path = '/data/workspace/yanmy/models/bge-m3'
router_model_path = '/data/workspace/yanmy/HybridRAG/H-STAR/router/bge-m3-finetuned/' ## fine-tuned router model path
check_moedl_path = '/data/workspace/yanmy/HybridRAG/H-STAR/check/output/bge-reranker-v2-m3-finetuned/' ## check model path
tmp_save_path = 'datasets/schedule_test/wikitq_7B' ## 临时存储路径
dataset_name = 'wikitq'
split = 'test'
tau = 0.82
check_tau = 0.8
ALL_LABELS = [
    'Base', 'Select_Row', 'Select_Column', 'Execute_SQL', 'RAG_20_5', 
]

### Pipeline 的过程分为以下调度步骤
- 所有调度需要的文件均放在了 `schedule_test/datasets/wikitq`与`schedule_test/datasets/tab_fact`文件夹里面
1. （独立的）跑下面的指令：`python convert_df_type_parallel.py --dataset_name tab_fact --split test_small --output_path datasets/schedule_test/tab_fact/wikitq_df_processed.npy --num_workers 32`
2. (独立的)读取 `datasets/schedule_test/tab_fact/wikitq_df_processed.npy`,构造 inference_router 的文件，输出到`datasets/schedule_test/tab_fact/router_query.pkl`
3. (独立的)构造 DB
4. (GPU-21GB) inference router model，输出route result 到 `datasets/schedule_test/tab_fact/inference_result.pkl` 通过命令：`python inference_router.py --input_path datasets/schedule_test/tab_fact/router_query.pkl --model_path /data/workspace/yanmy/HybridRAG/H-STAR/router/bge-m3-router-tab_fact-hn --output_path datasets/schedule_test/tab_fact/inference_result.pkl`
5. (CPU) 解析 router 结果，生成初步的路径并开始任务调度(重排)
6. (GPU-1.8G) 根据 `datasets/schedule_test/tab_fact/RAG_index.npy`，执行 RAG 任务，根据下面的指令
7. (GPU-vLLM) LLM 根据初步路径，对`Select_Row`, `Select_Column`, `Execute_SQL`执行中间命令
8. (CPU) 根据中间结果，link db 做sql command parse，执行 sql,返回 subtable_list
9. (GPU-1.8G) 加载并运行 Check Model，跑 3 次（FORWARD 机制）
10. (GPU-vLLM) add execute SQL
11. (GPU-vLLM) generate qa command, inference vLLM, evaluate

In [18]:
## step:1
f'python convert_df_type_parallel.py --dataset_name {dataset_name} --split {split} --output_path {tmp_save_path}/wikitq_df_processed.npy --num_workers {N_PARALLEL}'

'python convert_df_type_parallel.py --dataset_name wikitq --split test --output_path datasets/schedule_test/wikitq/wikitq_df_processed.npy --num_workers 32'

In [4]:
### 读取必要文件（step 2）
dataset = load_data_split(dataset_name,split)
wikitq_df_processed = np.load(f'{tmp_save_path}/wikitq_df_processed.npy',allow_pickle=True).item()

In [7]:
## step 2: 构建semantic router的输入文件，并输出
semantic_router = {}
# semantic_router[
for index in range(len(dataset)):
    semantic_router[index] = {}
    semantic_router[index]['query'] = dataset[index]['question']
    semantic_router[index]['title'] = dataset[index]['table']['page_title']
    semantic_router[index]['table'] = wikitq_df_processed[index]
    label_list = []
    semantic_router[index]['label'] = label_list
with open(f'{tmp_save_path}/router_query.pkl','wb') as f:
    pickle.dump(semantic_router,f)

In [5]:
## step 3: Consturct DB
from utils.multi_db_v2 import NeuralDB, Executor
table_titles = [dataset[i]['table']['page_title'] for i in range(len(dataset))]
db = NeuralDB(tables=wikitq_df_processed, table_titles=table_titles)
executor = Executor()

Initializing NeuralDB...

Creating tables in DB:   0%|          | 0/4344 [00:00<?, ?it/s]

In [9]:
## step 4: inference router model
f'python inference_router.py --input_path {tmp_save_path}/router_query.pkl --model_path {router_model_path} --output_path {tmp_save_path}/inference_result.pkl'

'python inference_router.py --input_path datasets/schedule_test/wikitq_api_server_30B/router_query.pkl --model_path /data/workspace/yanmy/HybridRAG/H-STAR/router/bge-m3-finetuned/ --output_path datasets/schedule_test/wikitq_api_server_30B/inference_result.pkl'

In [6]:
## step 5
with open(f'{tmp_save_path}/inference_result.pkl', 'rb') as f:
    error_analysis_row = pickle.load(f)
# with open(f'../router/inference_results.pkl', 'rb') as f:
#     error_analysis_row = pickle.load(f)
ranked_result = process_error_analysis_list(error_analysis_row, truncate=True, tau=0.82)
# pd.DataFrame([str(r) for r in ranked_result.values()]).value_counts()

0                                             
['Execute_SQL']                                   2657
['Base']                                           927
['Select_Row', 'Select_Column', 'Execute_SQL']     267
['Select_Column', 'Select_Row', 'Execute_SQL']     220
['Select_Row', 'Execute_SQL']                       63
['RAG_20_5', 'Select_Row', 'Execute_SQL']           43
['Select_Column', 'Execute_SQL']                    32
['Select_Row', 'RAG_20_5', 'Execute_SQL']           32
['RAG_20_5', 'Execute_SQL']                         24
['Select_Column', 'RAG_20_5', 'Execute_SQL']        22
['RAG_20_5', 'Select_Column', 'Execute_SQL']        21
['RAG_20_5']                                        21
['Select_Row']                                      15

In [7]:
## step 5
## Organize LLM query list
LLM_query_list = {}
for method in ALL_LABELS:
    LLM_query_list[method] = {}
    LLM_query_list[method]['index'] = []
    LLM_query_list[method]['query'] = []
    LLM_query_list[method]['qa'] = []
for index in range(len(dataset)):
    for method in ALL_LABELS:
        if method in ranked_result[index]:
            # method_list = ranked_result[index][method]
            # method_list.append(index)
            LLM_query_list[method]['index'].extend([index])
            if method=='Select_Column':
                prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/col_select_sql.txt',processed=True)
                LLM_query_list[method]['query'].extend([prompt])
            elif method=='Select_Row':
                prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/row_select_sql.txt',processed=True)
                LLM_query_list[method]['query'].extend([prompt])
            elif method == 'Execute_SQL':
                prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/sql_reason_wtq.txt',processed=True)
                LLM_query_list[method]['query'].extend([prompt])
            # elif method == 'Base':
            #     prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/text_reason_tabfact.txt',processed=True)
            #     LLM_query_list[method]['qa'].extend([prompt])

In [12]:
## step 5 暂存 RAG 的 list，输出到路径
np.save(f'{tmp_save_path}/RAG_index.npy',LLM_query_list['RAG_20_5']['index'])

- 执行`Hybrid_Retrieve.py` 任务

In [13]:
## step 6: RAG
f"python Hybrid_Retrieve_Update_dict.py \
    --model_path {embedding_base_model_path} \
    --dataset_name {dataset_name} \
    --split {split} \
    --index_path {tmp_save_path}/RAG_index.npy \
    --output_path {tmp_save_path}/Hybrid_Retrieve_output.npy \
    --max_rows 50 \
    --max_cols 10 \
    --processed_df_path {tmp_save_path}/wikitq_df_processed.npy \
    --rewrite_query_path datasets/schedule_test/{dataset_name}/rewrite_query.npy"

'python Hybrid_Retrieve_Update_dict.py     --model_path /data/workspace/yanmy/models/bge-m3     --dataset_name wikitq     --split test     --index_path datasets/schedule_test/wikitq_api_server_30B/RAG_index.npy     --output_path datasets/schedule_test/wikitq_api_server_30B/Hybrid_Retrieve_output.npy     --max_rows 50     --max_cols 10     --processed_df_path datasets/schedule_test/wikitq_api_server_30B/wikitq_df_processed.npy     --rewrite_query_path datasets/schedule_test/wikitq/rewrite_query.npy'

In [8]:
## load Hybrid_Retrieve 的结果
RAG_20_5 = np.load(f'{tmp_save_path}/Hybrid_Retrieve_output.npy',allow_pickle=True).item()

In [9]:
## step 7: api vLLM
### Query LLM with async engine，启动模型采用 sh llm_server.sh，这个是不是可以放在调度的第一个环节，不计入时间

metrics_rows = {}
summary = {}
for method in ['Select_Row','Select_Column']:
    prompt_list = LLM_query_list[method]['query']
    response_list,metrics_rows[method],summary[method] = infer_prompts(prompt_list, temperature=0.7, top_p=0.8, sample_num=2, llm_path = llm_path)
    LLM_query_list[method]['response'] = response_list
for method in ['Execute_SQL']:
    prompt_list = LLM_query_list[method]['query']
    response_list,metrics_rows[method],summary[method] = infer_prompts(prompt_list, temperature=0.7, top_p=0.8, sample_num=3, llm_path = llm_path)
    LLM_query_list[method]['response'] = response_list

Processed prompts:   0%|          | 0/774 [00:00<?, ?it/s]

Processed prompts: 100%|██████████| 774/774 [02:32<00:00,  5.06it/s, est. speed input=13904.37 toks/s, output=2264.83 toks/s]
Processed prompts: 100%|██████████| 678/678 [01:31<00:00,  7.37it/s, est. speed input=24311.11 toks/s, output=1966.03 toks/s]
Processed prompts: 100%|██████████| 3594/3594 [14:45<00:00,  4.06it/s, est. speed input=9833.87 toks/s, output=2103.60 toks/s]

- row_sql

In [10]:
## step 8: SQP parse row

from tqdm.notebook import tqdm
sub_table_list_all = {}
filtered_tables_row = {}
row_sql_index_list = LLM_query_list['Select_Row']['index']
row_sql_response_list = LLM_query_list['Select_Row']['response']
for i in range(len(row_sql_index_list)):
    sample_num = [0,1]
    sub_table_list = []
    for sample_index in sample_num:
        ## 相对距离
        index = row_sql_index_list[i]
        #  = row_sql_response_list[i][sample_index]
        # relevant_index = row_sql_index_list.index(index)
        original_text = row_sql_response_list[i][sample_index]
        sql = fix_sql_query(response_text=original_text,table_df=wikitq_df_processed[index],table_title=table_titles[index])
        try:
            result_1 = executor.sql_exec(sql.replace('``','`').replace("COUNT(*)", "*"), db, table_id=index)
            sub_table_list.append(pd.DataFrame(result_1['rows'],columns=result_1['header']))
        except:
            continue
    print(dataset[index]['question'],dataset[index]['answer_text'])
    # match_subtables(large_table=wikitq_df_processed[index], sub_tables=[pd.DataFrame(result_1['rows'],columns=result_1['header'])])
    # pd.DataFrame(result_1['rows'],columns=result_1['header'])
    sub_table_list_all[index] = sub_table_list
    filtered_df = retrieve_rows_by_subtables(wikitq_df_processed[index],sub_table_list)
    if len(filtered_df) == 0:
        filtered_df = wikitq_df_processed[index]
    filtered_tables_row[index] = filtered_df

Executing on table_id 4 ('w4'): SELECT * AS num_first_places FROM w WHERE placing = 1;
Executing on table_id 4 ('w4'): SELECT * AS num_first_places     FROM w     WHERE placing = 1;
what is the number of 1st place finishes across all events? ['17']
Executing on table_id 12 ('w12'): WITH relevant_rows AS (        SELECT * FROM Guillermo_García-López WHERE tournament < '2009'    )    SELECT SUM(year_end_ranking) AS total_ranking     FROM relevant_rows;
Executing on table_id 12 ('w12'): WITH relevant_years AS (        SELECT `year end ranking`         FROM Guillermo_García-López         WHERE `year end ranking` IS NOT NULL AND `tournament` < '2009'    )    SELECT SUM(`year end ranking`) AS total_ranking     FROM relevant_years;
what is the combined score of year end rankings before 2009? ['440']
Executing on table_id 15 ('w15'): WITH last_3_games AS (        SELECT * FROM w ORDER BY date DESC LIMIT 3    )    SELECT SUM(CASE WHEN SUBSTR(result, 0, INSTR(result, '-')-1) != '' THEN CAST(SUBSTR(result, 0, INSTR(result, '-')-1) AS INTEGER) ELSE 0 END) +           SUM(CASE WHEN SUBSTR(result, INSTR(result, '-')) != '' THEN CAST(SUBSTR(result, INSTR(result, '-')) AS INTEGER) ELSE 0 END)    FROM last_3_games;
Executing on table_id 15 ('w15'): WITH last_3_games AS (        SELECT * FROM w ORDER BY `date` DESC LIMIT 3    )    SELECT SUM(        CASE            WHEN SUBSTR(result, 0, 1) = 'w' THEN CAST(SUBSTR(result, 4, LOCATE('-', result) - 4) AS INTEGER)            ELSE CAST(SUBSTR(result, 4, LENGTH(result) - 4) AS INTEGER)        END    ) AS total_points    FROM last_3_games;
what was the total number of points scored by the tide in the last 3 games combined. ['68']
Executing on table_id 24 ('w24'): SELECT * FROM 2008_F__Tokyo_season     WHERE `match` = (SELECT `match` FROM 2008_F__Tokyo_season WHERE `match` = 'gl-b-5' ORDER BY `match` LIMIT 1, 1);
Executing on table_id 24 ('w24'): SELECT * FROM w WHERE `match` = 'gl-b-5' OR (`match` > 'gl-b-5' AND `match` IN (SELECT `match` FROM w ORDER BY `match` LIMIT 1 OFFSET 1));
what match comes after gl-b-5? ['GL-B-6']
Executing on table_id 29 ('w29'): SELECT * AS count FROM w WHERE `location` = 'val d''isère, france';
Executing on table_id 29 ('w29'): SELECT * FROM w WHERE `location` = 'val d''isère, france';
how many times was the val d'lsere, france location used? ['1']
Executing on table_id 36 ('w36'): SELECT DISTINCT * AS num_competitions_outside_UK FROM w WHERE country != 'united kingdom';
Executing on table_id 36 ('w36'): WITH uk_competitions_count AS (        SELECT * FROM w WHERE country = 'united kingdom'    ),    total_competitions_count AS (        SELECT * FROM w    )    SELECT (SELECT * FROM w) - (SELECT * FROM w WHERE country = 'united kingdom') AS non_uk_competitions;
how many competitions were not in the united kingdom? ['4']
Executing on table_id 44 ('w44'): WITH max_wins AS (        SELECT MAX(`total wins`) as max_value        FROM w    )    SELECT `season`     FROM w    WHERE `total wins` = (SELECT max_value FROM max_wins);
Executing on table_id 44 ('w44'): SELECT * FROM w WHERE `total wins` = (SELECT MAX(`total wins`) FROM w);
which year did the team have their most total wins? ['1992']
Executing on table_id 46 ('w46'): SELECT COUNT(DISTINCT model) AS total_models FROM w;
Executing on table_id 46 ('w46'): WITH unique_models AS (        SELECT DISTINCT model         FROM w    )    SELECT *     FROM unique_models    ;
what is the total number of models covered in the table? ['20']
Executing on table_id 49 ('w49'): SELECT * FROM w     WHERE `opponents` = 'millwall' OR (        `date` IN (            SELECT `date` + INTERVAL 1 DAY             FROM w             WHERE `opponents` = 'millwall'        )    );
Executing on table_id 49 ('w49'): WITH numbered_games AS (     SELECT          *,         ROW_NUMBER() OVER (ORDER BY `date`) as game_number     FROM          w ), consecutive_millwall AS (     SELECT          ng1.*,          LAG(ng1.game_number) OVER (ORDER BY `date`) as prev_game_number     FROM          numbered_games ng1     WHERE          `opponents` = 'millwall' ) SELECT      * FROM      consecutive_millwall WHERE      (game_number - prev_game_number) = 1 UNION ALL SELECT      * FROM      w WHERE      `opponents` = 'millwall';
how many times were consecutive games played against millwall? ['1']
Executing on table_id 60 ('w60'): WITH filtered_races AS (        SELECT * FROM w WHERE `season` = '2011'    )    SELECT * FROM filtered_races    WHERE (SELECT * FROM filtered_races) = 1;
Executing on table_id 60 ('w60'): WITH relevant_races AS (        SELECT * FROM w WHERE `season` = '2011'    )    SELECT `race` FROM relevant_races WHERE `race` IS NOT NULL AND `race` != 'season' AND `race` != 'date' AND `race` != 'location' AND `race` != 'NaN' AND `race` != 'none' OR `season` = '2011';
what was the only race in 2011? ['Giant Slalom']
Executing on table_id 63 ('w63'): SELECT * AS total_photos FROM w;
Executing on table_id 63 ('w63'): SELECT * FROM w;
how many photos total are listed? ['18']
Executing on table_id 77 ('w77'): SELECT `attendance` FROM w WHERE `iteration` = 'gamestorm 11';
Executing on table_id 77 ('w77'): SELECT `attendance` FROM w WHERE `iteration` = 'gamestorm 11';
what's the total attendance for gamestorm 11? ['736']
Executing on table_id 81 ('w81'): SELECT * FROM (     SELECT *      FROM w      WHERE "`city or town`" = 'barrington'     UNION ALL     SELECT *      FROM w      WHERE "`city or town`" = 'farmington'     UNION ALL     SELECT *      FROM w      WHERE "`city or town`" = 'rochester' ) AS combined_listings;
Executing on table_id 81 ('w81'): SELECT         (SELECT * FROM w WHERE `city or town` = 'barrington') +        (SELECT * FROM w WHERE `city or town` = 'farmington') +        (SELECT * FROM w WHERE `city or town` = 'rochester') AS total_listings;
what is the number of listings from barrington, farmington, and rochester combined? ['5']
Executing on table_id 103 ('w103'): SELECT `circuit` AS result_circuit     FROM w     WHERE `circuit` = 'portland'    UNION ALL    SELECT `circuit` AS result_circuit     FROM w     WHERE `round` < (SELECT `round` FROM w WHERE `circuit` = 'portland')     ORDER BY `round` DESC     LIMIT 1;
Executing on table_id 103 ('w103'): WITH ranked_races AS (        SELECT *, ROW_NUMBER() OVER (ORDER BY `round`) as rank        FROM w    )    SELECT `circuit`     FROM ranked_races    WHERE `circuit` = 'portland'    UNION ALL    SELECT `circuit`    FROM ranked_races    WHERE rank = (SELECT rank FROM ranked_races WHERE `circuit` = 'portland') - 1    OR `circuit` = 'portland';
what is the name of the circuit listed before portland? ['Westwood']
Executing on table_id 116 ('w116'): WITH ordered_dates AS (     SELECT          date:,         LAG(date:) OVER (ORDER BY date:) AS prev_date     FROM          w ) SELECT      * > 0 AS has_gap FROM      ordered_dates WHERE      JULIANDAY(date:) - JULIANDAY(prev_date) > 1;
Executing on table_id 116 ('w116'): WITH ordered_dates AS (     SELECT          date:,          LAG(date:) OVER (ORDER BY date:) AS prev_date     FROM          w ) SELECT      * FROM      ordered_dates WHERE      strftime('%Y-%m-%d', date:) != strftime('%Y-%m-%d', strftime('%Y-%m-%d %H:%M:%S', prev_date) + INTERVAL 1 DAY);
are the dates in a consecutive order? ['yes']
Executing on table_id 117 ('w117'): SELECT SUBSTR(name, 1, INSTR(name, ' ') - 1) AS firstname FROM w LIMIT 1;
Executing on table_id 117 ('w117'): SELECT SPLIT_PART(name, ' ', 1) AS first_name FROM w LIMIT 1;
what is the first name on the chart? ['Joel Smith']
Executing on table_id 128 ('w128'): SELECT * FROM w     WHERE date IN (        SELECT date FROM w         WHERE attendance = (SELECT MIN(attendance) FROM w)    );
Executing on table_id 128 ('w128'): SELECT * FROM w     WHERE attendance = (SELECT MIN(attendance) FROM w);
what date had the least number of attendees? ['27 August 2005']
Executing on table_id 129 ('w129'): SELECT *     FROM w     WHERE `opponent` LIKE 'at %' AND `result` = 'w';
Executing on table_id 129 ('w129'): SELECT * AS num_wins  FROM w  WHERE `opponent` LIKE 'at %' AND `result` = 'w';
how may away games did they win? ['7']
Executing on table_id 130 ('w130'): SELECT * AS total_subjects FROM w;
Executing on table_id 130 ('w130'): SELECT * FROM w;
how many total subjects are listed? ['25']
Executing on table_id 141 ('w141'): WITH relevant_rows AS (        SELECT * FROM w WHERE season < '1908'    )        SELECT SUM(`total wins`) AS total_wins_before_1908    FROM relevant_rows;
Executing on table_id 141 ('w141'): WITH relevant_rows AS (        SELECT * FROM w WHERE season < '1908'    )        SELECT SUM(`total wins`) AS total_wins_before_1908    FROM relevant_rows;
how many total wins did the citadel bulldogs have before 1908? ['6']
Executing on table_id 143 ('w143'): SELECT * AS num_conferences FROM w WHERE `# of bids` = 2;
Executing on table_id 143 ('w143'): SELECT * AS num_conferences FROM w WHERE `# of bids` = 2;
how many number of conferences had 2 bids? ['9']
Executing on table_id 144 ('w144'): WITH most_recent AS (        SELECT * FROM w ORDER BY strftime('%Y-%m-%d', `date listed`) DESC LIMIT 1    )    SELECT * FROM most_recent    UNION ALL    SELECT * FROM w    WHERE `city or town` IN ('dover', 'new durham', 'rochester', 'rollinsford', 'durham', 'somersworth');
Executing on table_id 144 ('w144'): SELECT * FROM w  WHERE `city or town` = 'strafford'  AND `date listed` = (SELECT MAX(`date listed`) AS max_date FROM w);
what was the last listed historical place in strafford county, new hampshire? ['Samuel Wyatt House']
Executing on table_id 146 ('w146'): SELECT * FROM w     WHERE `title` = 'like that'     OR `row_id` = (SELECT `row_id` FROM w WHERE `title` = 'like that') + 1;
Executing on table_id 146 ('w146'): SELECT *     FROM w     WHERE title = 'like that'     OR # = (SELECT # FROM w WHERE title = 'like that') + 1;
which track comes after "like that"? ['"Call It What You Want"']
Executing on table_id 157 ('w157'): SELECT (SELECT * FROM w WHERE `points` > 2) AS driver_count;
Executing on table_id 157 ('w157'): SELECT * FROM w WHERE points > 2;
how many drivers earned more than 2 points at the 2003 grand prix of monterey? ['10']
Executing on table_id 158 ('w158'): WITH halley_encounters AS (        SELECT REPLACE(spacecraft_encounter(s), ',', '|') AS spacecraft_encounter         FROM w         WHERE comet LIKE '%halley%'        GROUP BY spacecraft_encounter(s)    )        SELECT COUNT(DISTINCT spacecraft_encounter) FROM halley_encounters;
Executing on table_id 158 ('w158'): WITH halley_rows AS (        SELECT * FROM w         WHERE comet LIKE '%halley%'    )    SELECT COUNT(DISTINCT spacecraft_encounter(s))     FROM halley_rows;
how many different flyby's have been done for the halley comet? ['6']
Executing on table_id 159 ('w159'): WITH date_range AS (        SELECT MIN(year) AS min_year, MAX(year) AS max_year        FROM w    )    SELECT (max_year - min_year) + 1 AS time_frame_years    FROM date_range;
Executing on table_id 159 ('w159'): WITH extrema AS (        SELECT MIN(year) as start_year, MAX(year) as end_year        FROM w    )    SELECT (end_year - start_year) + 1 AS time_frame_in_years    FROM extrema;
how long is the time frame in years of the table? ['16']
Executing on table_id 169 ('w169'): SELECT COUNT(DISTINCT `circuit`) AS total_circuits FROM w;
Executing on table_id 169 ('w169'): SELECT COUNT(DISTINCT `circuit`) AS total_circuits FROM w;
how many circuits are there total? ['10']
Executing on table_id 176 ('w176'): SELECT * FROM w WHERE `championship\ngame` = '1';
Executing on table_id 176 ('w176'): SELECT * FROM w WHERE `championship\ngame` = '1';
how many teams played in a championship game? ['2']
Executing on table_id 178 ('w178'): SELECT position FROM w WHERE `college/junior/club team` = 'minnesota north stars' OR (`nationality` = 'finland' AND `pick #` < 160) ORDER BY `pick #` DESC LIMIT 1;
Executing on table_id 178 ('w178'): SELECT position  FROM w  WHERE (player = 'Kari Kanervo') OR (row_id = (SELECT row_id FROM w WHERE player = 'Kari Kanervo'));
what is the position of the player above kari kanervo? ['Left Wing']
Executing on table_id 179 ('w179'): SELECT *  FROM w  WHERE (`air date` < '2007-11-15' AND rank (overall) BETWEEN '30' AND '39');
Executing on table_id 179 ('w179'): SELECT *     FROM (        SELECT *         FROM w         WHERE air_date < '2007-11-15'        UNION ALL        SELECT *, CASE WHEN rank (overall) BETWEEN '30' AND '39' THEN 1 ELSE 0 END AS is_in_30s         FROM w         WHERE air_date < '2007-11-15'    ) AS subquery    WHERE is_in_30s = 1;
previous to november 15, 2007 how often was the overall rank in the 30s? ['3']
Executing on table_id 181 ('w181'): SELECT * AS total_games_played FROM w WHERE venue = 'stadium of light';
Executing on table_id 181 ('w181'): SELECT * AS total_games_played FROM w WHERE venue = 'stadium of light';
what was the total number of games played at stadium of light? ['19']
Executing on table_id 182 ('w182'): SELECT * FROM w     WHERE CAST(SUBSTR(result, 1, INSTR(result, '-') - 1) AS INTEGER) =     (SELECT MAX(CAST(SUBSTR(result, 1, INSTR(result, '-') - 1) AS INTEGER)) FROM w);
Executing on table_id 182 ('w182'): SELECT * FROM w     WHERE result = (SELECT MAX(result::INT) FROM w);
what year had the highest results? ['2009']
Executing on table_id 187 ('w187'): SELECT * FROM w WHERE `original air date` < '1965-12-01' OR 1=1;
Executing on table_id 187 ('w187'): SELECT * FROM w WHERE `original air date` < '1965-12-01' OR 1=1;
how many episodes aired before december 1st, 1965? ['10']
Executing on table_id 190 ('w190'): SELECT * FROM w     WHERE year = (SELECT MAX(year) FROM w);
Executing on table_id 190 ('w190'): SELECT * FROM w     WHERE year = (SELECT MAX(year) FROM Lars_von_Triier)     OR (year, film) IN ((SELECT MAX(year), film FROM Lars_von_Triier));
what is the last film that lars von trier made? ['Nymphomaniac: Volume II']
Executing on table_id 208 ('w208'): SELECT `number of counties` FROM List_of_places_in_Pennsylvania_Sa–Si WHERE `name of place` LIKE '%saegertown%' ;
Executing on table_id 208 ('w208'): SELECT `number of counties` FROM List_of_places_in_Pennsylvania_Sa–Si WHERE `name of place` = 'saegertown';
what is the number of counties in saegertown, pennsylvania? ['1']
Executing on table_id 210 ('w210'): WITH scored_players AS (        SELECT DISTINCT SUBSTR(scorers, INSTR(scorers, ', ') + 2) AS scorer_name FROM w         UNION ALL         SELECT DISTINCT LEFT(scorers, INSTR(scorers, ', ') - 1) AS scorer_name FROM w    )    SELECT scorer_name, * AS goal_count FROM scored_players GROUP BY scorer_name ORDER BY goal_count DESC LIMIT 1;
Executing on table_id 210 ('w210'): WITH scored_players AS (        SELECT scorer, * AS goal_count FROM w GROUP BY scorer    )    SELECT scorer FROM scored_players WHERE scorer IN (        SELECT scorer FROM scored_players ORDER BY goal_count DESC LIMIT 1    );
which player scored the most in this season? ['Greaves']
Executing on table_id 214 ('w214'): WITH over_3min AS (        SELECT * FROM w WHERE time >= '3:00'    )    SELECT * FROM over_3min    UNION ALL    SELECT * FROM w LIMIT 1    ORDER BY CASE WHEN EXISTS (SELECT 1 FROM over_3min) THEN 0 ELSE 1 END, row_id;
Executing on table_id 214 ('w214'): WITH over_3min AS (        SELECT * FROM w WHERE time >= '3:00'    )    SELECT * FROM over_3min    UNION ALL    SELECT * FROM w LIMIT 1    ORDER BY CASE WHEN EXISTS (SELECT 1 FROM over_3min) THEN 0 ELSE 1 END, row_id;
all songs are over 3:00 but which song? ['Intro']
Executing on table_id 215 ('w215'): SELECT `school/club team`     FROM w     WHERE `player` = 'bill bailey'    OR `pick` = (SELECT `pick` + 1 FROM w WHERE `player` = 'bill bailey');
Executing on table_id 215 ('w215'): SELECT `school/club team`     FROM w     WHERE `player` = 'bill bailey'    OR `pick` = (SELECT `pick` + 1 FROM w WHERE `player` = 'bill bailey');
school attended of player picked next after bill bailey ['Texas Pan-American']
Executing on table_id 232 ('w232'): SELECT `opponents`     FROM w     WHERE `date` = (SELECT MIN(`date`) FROM w);
Executing on table_id 232 ('w232'): SELECT `opponents`     FROM w     WHERE `date` = (SELECT MIN(`date`) FROM w)     OR `row_id` = 0;
who was this team's first opponent during this season? ['Reading']
Executing on table_id 233 ('w233'): SELECT * FROM w WHERE `manufacturer` = (SELECT `manufacturer` FROM w ORDER BY `year` DESC LIMIT 1);
Executing on table_id 233 ('w233'): SELECT DISTINCT manufacturer FROM w ORDER BY year DESC LIMIT 1;
what is the name of the last manufacturer on this chart? ['Gillig']
Executing on table_id 234 ('w234'): SELECT *     FROM w     WHERE position = 'left wing' OR (`pick #` BETWEEN 144 AND 151);
Executing on table_id 234 ('w234'): SELECT * AS count FROM w WHERE position = 'left wing';
how many left wings were picked in the eighth round? ['5']
Executing on table_id 237 ('w237'): # Query to count the number of seasons Kevin Higgins coached SELECT * AS k_higgins_seasons  FROM w  WHERE `head coach` = 'kevin higgins';  # Query to count the number of seasons Don Powers coached SELECT * AS d_powers_seasons  FROM w  WHERE `head coach` = 'don powers';  # Combined query using OR WITH k_higgins_count AS (     SELECT * AS k_higgins_seasons      FROM w      WHERE `head coach` = 'kevin higgins' ), d_powers_count AS (     SELECT * AS d_powers_seasons      FROM w      WHERE `head coach` = 'don powers' ) SELECT      CASE          WHEN k_higgins_seasons > d_powers_seasons THEN 'Kevin Higgins'         ELSE 'Don Powers'     END AS longer_coach FROM k_higgins_count, d_powers_count;
Executing on table_id 237 ('w237'): WITH kevin_higgins AS (     SELECT * AS count_k_higgins      FROM w      WHERE head_coach = 'kevin higgins' ), don_powers AS (     SELECT * AS count_d_powers      FROM w      WHERE head_coach = 'don powers' ) SELECT      CASE          WHEN (SELECT count_k_higgins FROM kevin_higgins) > (SELECT count_d_powers FROM don_powers) THEN 'Kevin Higgins'         ELSE 'Don Powers'     END AS longer_serving_coach;
which coach served longer, higgins or powers? ['Kevin Higgins']
Executing on table_id 240 ('w240'): SELECT destinations FROM w ORDER BY route DESC LIMIT 1;
Executing on table_id 240 ('w240'): SELECT destinations FROM w ORDER BY route DESC LIMIT 1;
what is the name of the last destination listed on this chart? ['Bus Terminal']
Executing on table_id 246 ('w246'): SELECT * AS total_picks FROM w;
Executing on table_id 246 ('w246'): SELECT * AS total_picks_in_eighth_round     FROM w     WHERE `pick #` BETWEEN 176 AND 200;
what is the number of total picks in the eighth round? ['21']
Executing on table_id 270 ('w270'): SELECT * FROM w WHERE `yacht` = 'industrial quest';
Executing on table_id 270 ('w270'): SELECT * FROM w WHERE `yacht` = 'industrial quest';
how long did it take the industrial quest to complete the course? ['3:14:58:46']
Executing on table_id 271 ('w271'): SELECT * FROM w WHERE time = (SELECT MIN(time) FROM w);
Executing on table_id 271 ('w271'): SELECT `title`, `time` FROM w WHERE `time` = (SELECT MIN(`time`) FROM w);
how long is the shortest song? ['0:49']
Executing on table_id 282 ('w282'): SELECT * FROM I_Spy_1965_TV_series WHERE `directed by` LIKE '%leo penn%';
Executing on table_id 282 ('w282'): SELECT * AS episode_count FROM w WHERE `directed by` LIKE '%leo penn%';
how many episodes were directed by leo penn? ['4']
Executing on table_id 290 ('w290'): SELECT COUNT(DISTINCT competition) AS total_competitions FROM w;
Executing on table_id 290 ('w290'): SELECT COUNT(DISTINCT competition) AS total_competitions FROM w;
what is the total number of competition? ['20']
Executing on table_id 293 ('w293'): SELECT * FROM w     WHERE `giant\nslalom` > 20 AND `super g` <= 0;
Executing on table_id 293 ('w293'): SELECT * FROM w     WHERE (`giant\nslalom` > 20 AND `super g` IS NULL OR `super g` = 0);
what season had more than 20 in giant slalom but not super g? ['2014']

- col_sql

In [11]:
## step 8: SQP parse column
filtered_tables = {}
filtered_headers = {}
col_sql_index_list = LLM_query_list['Select_Column']['index']
col_sql_response_list = LLM_query_list['Select_Column']['response']
# for ind in tqdm(range(len(wikitq_df_processed))):
for i in range(len(col_sql_index_list)):
    ind = col_sql_index_list[i]
    
    input_df = wikitq_df_processed[ind]
    response_list = col_sql_response_list[i]
    assert isinstance(response_list,list)
    filtered_table, final_headers = filter_dataframe_from_responses(response_list, input_df, add_row_id=True)
    filtered_tables[ind] = filtered_table
    filtered_headers[ind] = final_headers

- SQL-exec

In [12]:
## step 8: SQP parse execute
from tqdm.notebook import tqdm
sample_num = 3
sql_exec_df = {}
valid_parse = 0
warning_list = []
sql_executable_count = []
exec_sql_index_list = LLM_query_list['Execute_SQL']['index']
exec_sql_response_list = LLM_query_list['Execute_SQL']['response']
# for index in tqdm(range(len(wikitq_df_processed))):
for i in range(len(exec_sql_index_list)):
    index = exec_sql_index_list[i]
    sql_exec_df[index] = []
    for sample_ind in range(sample_num):
        
        # original_text = eval(wikitq_df_output.iloc[index,-1])[sample_ind]
        original_text = exec_sql_response_list[i][sample_ind]
        sql = fix_sql_query(response_text=original_text,table_df=wikitq_df_processed[index],table_title=table_titles[index])
        if [index,sample_ind] in warning_list:
            sql = ''
            print(index,sample_ind)
        if sql!='':
            # print(result)
            try:
                result = executor.sql_exec(sql.replace('``','`'), db, table_id=index,add_row_id = True)
                df = pd.DataFrame(result['rows'],columns=result['header'])
            except:
                df = pd.DataFrame()
        else:
            df = pd.DataFrame()
        sql_exec_df[index].append(df)
        if(len(df)>0):
            valid_parse+=1
            sql_pair = {}
            sql_pair['id'] = index
            sql_pair['sample_ind'] = sample_ind
            sql_pair['sql'] = sql
            sql_pair['table'] = df
            sql_executable_count.append(sql_pair)
sql_exec_df_output = merge_clean_and_format_df_dict(sql_exec_df)
    # print(original_text)

Executing on table_id 0 ('w0'): SELECT SUBSTR(cyclist, INSTR(cyclist, ' (') + 3, INSTR(cyclist, ')') - INSTR(cyclist, ' (') - 3) AS country, COUNT(*) AS num_cyclists FROM w WHERE rank BETWEEN 1 AND 10 GROUP BY country ORDER BY num_cyclists DESC LIMIT 1;
Executing on table_id 0 ('w0'): SELECT SUBSTR(cyclist, INSTR(cyclist, ' ') + 1) AS country, COUNT(*) AS num_cyclists FROM w WHERE rank BETWEEN 1 AND 10 GROUP BY country ORDER BY num_cyclists DESC LIMIT 1;
Executing on table_id 0 ('w0'): SELECT SUBSTR(cyclist, INSTR(cyclist, ' ') + 1) AS nationality, COUNT(*) AS cyclist_count FROM w WHERE rank <= 10 GROUP BY nationality ORDER BY cyclist_count DESC LIMIT 1;
Executing on table_id 1 ('w1'): SELECT `1940/41` FROM w WHERE `description losses` = 'murdered';
Executing on table_id 1 ('w1'): SELECT `1940/41` FROM w WHERE `description losses` = 'murdered';
Executing on table_id 1 ('w1'): SELECT `1940/41` FROM w WHERE `description losses` = 'murdered';
Executing on table_id 3 ('w3'): SELECT original_air_date FROM w WHERE original_air_date > '1995-1-19' ORDER BY original_air_date ASC LIMIT 1;
Executing on table_id 3 ('w3'): WITH birthday_party_row AS (   SELECT *, ROW_NUMBER() OVER (ORDER BY original_air_date) as rn   FROM w   WHERE title = 'alfie''s birthday party' ) SELECT original_air_date FROM w WHERE ROW_NUMBER() OVER (ORDER BY original_air_date) =       (SELECT rn + 1 FROM birthday_party_row);
Executing on table_id 3 ('w3'): SELECT `original air date`  FROM w  WHERE `original air date` > '1995-1-19'  ORDER BY `original air date`  LIMIT 1;
Executing on table_id 4 ('w4'): SELECT COUNT(*) AS first_place_finishes FROM w WHERE placing = 1;
Executing on table_id 4 ('w4'): SELECT COUNT(*) AS first_place_finishes FROM w WHERE placing = 1;
Executing on table_id 4 ('w4'): SELECT COUNT(*) AS first_place_finishes FROM w WHERE placing = 1;
Executing on table_id 5 ('w5'): SELECT competition FROM w WHERE position = '1st';
Executing on table_id 5 ('w5'): SELECT competition FROM w WHERE position = '1st';
Executing on table_id 5 ('w5'): SELECT competition FROM w WHERE position = '1st';
Executing on table_id 6 ('w6'): SELECT COUNT(*) AS total_films FROM w WHERE `language` = 'kannada';
Executing on table_id 6 ('w6'): SELECT COUNT(*) AS total_films FROM w WHERE `language` = 'kannada';
Executing on table_id 6 ('w6'): SELECT COUNT(*) AS total_films_kannada FROM w WHERE language = 'kannada';
Executing on table_id 8 ('w8'): SELECT `year` FROM w WHERE `shirt sponsor` = 'none';
Executing on table_id 8 ('w8'): SELECT `year` FROM w WHERE `shirt sponsor` = 'none';
Executing on table_id 8 ('w8'): SELECT `year` FROM w WHERE `shirt sponsor` IS NULL OR LENGTH(TRIM(`shirt sponsor`)) = 0;
Executing on table_id 9 ('w9'): SELECT MIN(year) AS first_1st_place_year FROM w WHERE `position` = '1st';
Executing on table_id 9 ('w9'): SELECT MIN(year) AS first_first_place_year FROM w WHERE position = '1st';
Executing on table_id 9 ('w9'): SELECT MIN(year) AS first_first_place_year FROM w WHERE position = '1st';
Executing on table_id 10 ('w10'): WITH cte AS (     SELECT          season,         record,         LAG(record, 1) OVER (ORDER BY season) AS prev_record,         LAG(record, 2) OVER (ORDER BY season) AS prev_prev_record     FROM          w ) SELECT      season,      record,      prev_record,      prev_prev_record FROM      cte WHERE      record = prev_record AND      prev_record = prev_prev_record;
Executing on table_id 10 ('w10'): WITH ranked_data AS (     SELECT          season,         record,         LAG(record, 1) OVER (ORDER BY season) AS prev_record,         LAG(record, 2) OVER (ORDER BY season) AS prev_prev_record     FROM          w ) SELECT      season,      record,      prev_record,      prev_prev_record FROM      ranked_data WHERE      record = prev_record AND      prev_record = prev_prev_record LIMIT 1;
Executing on table_id 10 ('w10'): WITH RankedRecords AS (     SELECT season, record,            ROW_NUMBER() OVER(PARTITION BY record ORDER BY season) AS rn     FROM w ) SELECT DISTINCT rr1.season AS first_year, rr2.season AS second_year, rr3.season AS third_year FROM RankedRecords rr1 JOIN RankedRecords rr2 ON rr1.record = rr2.record AND rr1.rn + 1 = rr2.rn JOIN RankedRecords rr3 ON rr2.record = rr3.record AND rr2.rn + 1 = rr3.rn AND rr2.rn <> rr3.rn - 1;
Executing on table_id 11 ('w11'): SELECT `name`, `total` FROM w WHERE `name` IN ('pat baldwin', 'john o''flynn');
Executing on table_id 11 ('w11'): plaintext Final Output:  SELECT      CASE          WHEN (SELECT total FROM w WHERE name = 'pat baldwin') > (SELECT total FROM w WHERE name = 'john o''flynn') THEN 'pat baldwin'         ELSE 'john o''flynn'     END AS highest_total_player;
Executing on table_id 11 ('w11'): SELECT CASE      WHEN (SELECT `total` FROM w WHERE `name` = 'pat baldwin') > (SELECT `total` FROM w WHERE `name` = 'john o''flynn')      THEN 'Pat'      ELSE 'John'  END AS highest_total_player;
Executing on table_id 12 ('w12'): SELECT SUM(`year end ranking`) AS combined_rankings_before_2009 FROM w WHERE row_id < 2009;
Executing on table_id 12 ('w12'): SELECT SUM(`year end ranking`) AS combined_rankings FROM w WHERE row_id < 2009;
Executing on table_id 12 ('w12'): SELECT (`2004` + `2005` + `2006` + `2007` + `2008`) AS combined_score FROM w;
Executing on table_id 14 ('w14'): SELECT name FROM w WHERE `c string` = 'none';
Executing on table_id 14 ('w14'): SELECT name FROM w WHERE `c string` = 'none';
Executing on table_id 14 ('w14'): SELECT `name` FROM w WHERE `c string` = 'none';
Executing on table_id 15 ('w15'): SELECT      SUM(CAST(SUBSTR(result, 1, INSTR(result, '-') - 1) AS INTEGER) + CAST(SUBSTR(result, INSTR(result, '-') + 1) AS INTEGER)) AS total_points FROM w WHERE date IN (     SELECT date      FROM w      ORDER BY date DESC      LIMIT 3 );
Executing on table_id 15 ('w15'): SELECT      SUM(         CAST(SUBSTR(result, 1, INSTR(result, '-') - 1) AS INTEGER) +         CAST(SUBSTR(result, INSTR(result, '-') + 1) AS INTEGER)     ) AS total_points FROM w WHERE date IN (     SELECT date      FROM w      ORDER BY date DESC      LIMIT 3 );
Executing on table_id 15 ('w15'): SELECT SUM(CAST(score_won AS INTEGER) + CAST(score_lost AS INTEGER)) AS total_points FROM (     SELECT          SUBSTR(result, 4, INSTR(result, '-') - 4) AS score_won,         SUBSTR(result, INSTR(result, '-') + 1) AS score_lost     FROM w     WHERE date IN (         SELECT date          FROM w          ORDER BY date DESC          LIMIT 3     )     UNION ALL     SELECT          SUBSTR(result, 4, INSTR(result, '-') - 4),         SUBSTR(result, INSTR(result, '-') + 1)     FROM w     WHERE date = (         SELECT date          FROM w          ORDER BY date DESC          LIMIT 1 OFFSET 2     ) );
Executing on table_id 16 ('w16'): SELECT * FROM w WHERE `pos` = '13';
Executing on table_id 16 ('w16'): WITH ranked_rows AS (     SELECT *, ROW_NUMBER() OVER (ORDER BY pos) AS rn     FROM w ) SELECT * FROM ranked_rows WHERE rider = 'sebastian porto' AND rn + 1 IN (     SELECT rn     FROM ranked_rows );
Executing on table_id 16 ('w16'): SELECT pos, rider, manufacturer, time/retired, points  FROM w  WHERE pos = 13;
Executing on table_id 17 ('w17'): SELECT COUNT(*) AS total_festivals_in_october  FROM w  WHERE 'date' LIKE '%oct%' OR 'date' LIKE '%octo%';
Executing on table_id 17 ('w17'): SELECT COUNT(*) AS total_festivals_in_october FROM w WHERE SUBSTR(`date`, 6, 2) = '10';
Executing on table_id 17 ('w17'): SELECT COUNT(*) AS total_festivals_in_october FROM w WHERE `date` LIKE '%oct%';
Executing on table_id 18 ('w18'): SELECT name FROM w WHERE hospital_beds = 6;
Executing on table_id 18 ('w18'): SELECT name FROM w WHERE `hospital beds` = 6;
Executing on table_id 18 ('w18'): SELECT name FROM w WHERE `hospital beds` = 6;
Executing on table_id 19 ('w19'): SELECT SUM(`2005`) AS total_sales FROM w WHERE model != 'total';
Executing on table_id 19 ('w19'): SELECT SUM(CAST(`2005` AS INT)) AS total_sales_2005 FROM w WHERE model != 'total';
Executing on table_id 19 ('w19'): SELECT SUM(CAST(`1995` AS INTEGER)) AS total_sales_2005 FROM w WHERE `model` != 'total';
Executing on table_id 20 ('w20'): SELECT COUNT(*) AS num_wins_on_grass  FROM w  WHERE `surface` = 'grass' AND `outcome` = 'winner';
Executing on table_id 20 ('w20'): SELECT COUNT(*) AS num_wins_on_grass  FROM w  WHERE `surface` = 'grass' AND `outcome` = 'winner';
Executing on table_id 20 ('w20'): SELECT COUNT(*) AS num_wins_on_grass  FROM w  WHERE `surface` = 'grass' AND `outcome` = 'winner';
Executing on table_id 22 ('w22'): SELECT SUM(wins) AS total_wins FROM w WHERE country = 'belgium';
Executing on table_id 22 ('w22'): SELECT SUM(`wins`) AS total_wins FROM w WHERE `country` = 'belgium';
Executing on table_id 22 ('w22'): SELECT SUM(wins) AS total_wins FROM w WHERE `country` = 'belgium';
Executing on table_id 24 ('w24'): -- First, select the row with 'gl-b-5' WITH gl_b_5_row AS (     SELECT * FROM w WHERE `match` = 'gl-b-5' ), -- Then, find the next row in the sequence next_match AS (     SELECT * FROM w     WHERE `match` > (SELECT `match` FROM gl_b_5_row)     ORDER BY `match`     LIMIT 1 ) SELECT `match` FROM next_match;
Executing on table_id 24 ('w24'): SELECT match FROM w WHERE match > 'gl-b-5';
Executing on table_id 25 ('w25'): SELECT COUNT(*) AS count FROM w WHERE `judging panel` LIKE '%amanda holden%';
Executing on table_id 25 ('w25'): SELECT COUNT(*) AS number_of_times FROM w WHERE `judging panel` LIKE '%amanda holden%';
Executing on table_id 25 ('w25'): SELECT COUNT(*) AS count FROM w WHERE 'amanda holden' IN (`judging panel`);
Executing on table_id 26 ('w26'): SELECT COUNT(*) AS total_wins FROM w WHERE `result` = 'won';
Executing on table_id 26 ('w26'): SELECT COUNT(*) AS total_awards_won FROM w WHERE `result` = 'won';
Executing on table_id 26 ('w26'): SELECT COUNT(*) AS number_of_wins FROM w WHERE result = 'won';
Executing on table_id 27 ('w27'): WITH LatestSeason AS (     SELECT MAX(season) AS max_season FROM w ) SELECT `league
top scorer` FROM w WHERE season = (SELECT max_season FROM LatestSeason);
Executing on table_id 27 ('w27'): SELECT `league
top scorer`  FROM w  WHERE season = (SELECT MAX(season) FROM w);
Executing on table_id 27 ('w27'): SELECT league\ntop_scorer FROM w WHERE season = (SELECT MAX(season) FROM w);
Executing on table_id 28 ('w28'): SELECT COUNT(DISTINCT contestant) AS num_jury_members  FROM (SELECT contestant FROM w WHERE finish LIKE '%jury%' OR finish LIKE '%member%');
Executing on table_id 28 ('w28'): SELECT COUNT(*) AS number_of_jury_members FROM w WHERE `finish` LIKE '%jury member%';
Executing on table_id 28 ('w28'): SELECT COUNT(DISTINCT `finish`) AS number_of_jury_members FROM w WHERE `finish` LIKE '%jury%';
Executing on table_id 29 ('w29'): SELECT COUNT(*) AS count FROM w WHERE `location` = 'val d''isère, france';
Executing on table_id 29 ('w29'): SELECT COUNT(*) AS times_used FROM w WHERE `location` = 'val d''isère, france';
Executing on table_id 29 ('w29'): SELECT COUNT(*) AS count FROM w WHERE `location` = 'val d''isère, france';
Executing on table_id 30 ('w30'): -- First, get the index of the 'mount pleasant line' WITH indexed_rows AS (     SELECT          ROW_NUMBER() OVER (ORDER BY route) AS idx,         *     FROM w ) -- Then, select the name of the row just before the 'mount pleasant line' SELECT      name FROM indexed_rows WHERE idx = (SELECT idx FROM indexed_rows WHERE name = 'mount pleasant line') - 1;
Executing on table_id 30 ('w30'): SELECT `name` FROM w WHERE `route` = 'mountain pleasant line';
Executing on table_id 30 ('w30'): SELECT `name` FROM w WHERE `route` = 'mount pleasant line';
Executing on table_id 31 ('w31'): SELECT stadium FROM SuperLeagueXVIV ORDER BY row_id DESC LIMIT 1;
Executing on table_id 31 ('w31'): SELECT stadium FROM w ORDER BY row_id ASC LIMIT 1 OFFSET (SELECT COUNT(*) - 1 FROM w);
Executing on table_id 31 ('w31'): SELECT stadium FROM w WHERE row_id = (SELECT MAX(row_id) FROM w);
Executing on table_id 32 ('w32'): SELECT COUNT(*) AS total_first_places FROM w WHERE `position` = '1st';
Executing on table_id 32 ('w32'): SELECT COUNT(*) AS first_place_wins FROM w WHERE `position` = '1st';
Executing on table_id 32 ('w32'): SELECT COUNT(*) AS num_first_places FROM w WHERE `position` = '1st';
Executing on table_id 34 ('w34'): SELECT `candidate`, `height`  FROM w  WHERE `height` = (SELECT `height` FROM w WHERE `candidate` = 'natalia varnakova')  AND `candidate` != 'natalia varnakova';
Executing on table_id 34 ('w34'): SELECT candidate  FROM w  WHERE height = (SELECT height FROM w WHERE in_russian = 'наталиа варнакова');
Executing on table_id 34 ('w34'): WITH nat_var_height AS (     SELECT `height` FROM w WHERE `candidate` = 'natalia varnakova' ) SELECT `candidate`, `height` FROM w WHERE `height` = (SELECT `height` FROM nat_var_height) AND `candidate` != 'natalia varnakova';
Executing on table_id 35 ('w35'): SELECT COUNT(*) AS non_dem_non_rep_candidates FROM w WHERE democratic NOT IN ('democratic') AND republican NOT IN ('republican');
Executing on table_id 35 ('w35'): SELECT COUNT(*) FROM w WHERE (`democratic` != '' AND `republican` = '') OR (`democratic` = '' AND `republican` != '');
Executing on table_id 35 ('w35'): SELECT COUNT(*) AS number_of_other_party_candidates  FROM w  WHERE democratic NOT IN ('democratic', '') AND republican NOT IN ('republican', '');
Executing on table_id 36 ('w36'): SELECT COUNT(DISTINCT competition) AS num_competitions_not_in_uk FROM w WHERE location != 'united kingdom';
Executing on table_id 36 ('w36'): SELECT COUNT(*) AS non_uk_competitions FROM w WHERE location != 'manchester';
Executing on table_id 36 ('w36'): SELECT COUNT(*) AS non_uk_competitions FROM w WHERE `location` != 'manchester';
Executing on table_id 37 ('w37'): SELECT COUNT(*) AS count_united_carriers FROM w WHERE city = 'houston, tx' AND 'united' IN `top carriers`;
Executing on table_id 37 ('w37'): SELECT COUNT(*) AS unites_carrier_count  FROM w  WHERE city = 'houston intercontinental' AND 'united' IN (SELECT UNNEST(STRING_TO_ARRAY(`top carriers`, ', ')) FROM w WHERE `top carriers` LIKE '%united%');
Executing on table_id 37 ('w37'): SELECT COUNT(*) AS count_united_carrier FROM w WHERE `top carriers` LIKE '%united%';
Executing on table_id 38 ('w38'): SELECT COUNT(*) AS total_germans FROM w WHERE `country` = 'germany';
Executing on table_id 38 ('w38'): SELECT COUNT(*) AS total_germans FROM w WHERE `country` = 'germany';
Executing on table_id 38 ('w38'): SELECT COUNT(*) AS total_germans FROM w WHERE `country` = 'germany';
Executing on table_id 39 ('w39'): SELECT MIN(season) FROM w WHERE `giant\nslalom` != '-';
Executing on table_id 39 ('w39'): SELECT season, giant_slalom FROM w WHERE giant_slalom IS NOT NULL ORDER BY season LIMIT 1;
Executing on table_id 39 ('w39'): SELECT MIN(season) AS first_year_giant_slalom  FROM w  WHERE `giant\nslalom` IS NOT NULL;
Executing on table_id 40 ('w40'): SELECT COUNT(*) AS number_of_contestants_older_than_20 FROM w WHERE `age` > 20;
Executing on table_id 40 ('w40'): SELECT COUNT(*) AS number_of_contestants_older_than_20 FROM w WHERE `age` > 20;
Executing on table_id 40 ('w40'): SELECT COUNT(*) AS num_contestants_older_than_20 FROM w WHERE age > 20;
Executing on table_id 41 ('w41'): SELECT      'clint dempsey' AS player,      `goals`  FROM w  WHERE `player` = 'clint dempsey' UNION ALL SELECT      'eric wynalda' AS player,      `goals`  FROM w  WHERE `player` = 'eric wynalda';
Executing on table_id 41 ('w41'): SELECT player, goals FROM w WHERE player IN ('clint dempsey', 'eric wynalda');
Executing on table_id 41 ('w41'): SELECT `player`, `goals`  FROM w  WHERE `player` = 'clint dempsey' OR `player` = 'eric wynalda';
Executing on table_id 42 ('w42'): SELECT name, CAST(REPLACE(height\\nmetres / ft, ',', '') AS REAL) AS height FROM w WHERE country = 'germany' ORDER BY height ASC LIMIT 1;
Executing on table_id 42 ('w42'): SELECT name, MIN(`height
metres / ft`) AS min_height FROM w WHERE country = 'germany';
Executing on table_id 42 ('w42'): WITH minHeight AS (     SELECT MIN(CAST(SUBSTR(`height
metres / ft`, 1, INSTR(`height
metres / ft`, '/') - 1) AS REAL)) AS min_numeric_height      FROM w      WHERE `country` = 'germany' ) SELECT `name`  FROM w  WHERE `country` = 'germany'  AND CAST(SUBSTR(`height
metres / ft`, 1, INSTR(`height
metres / ft`, '/') - 1) AS REAL) = (SELECT min_numeric_height FROM minHeight);
Executing on table_id 43 ('w43'): WITH maine_candidates AS (     SELECT `candidates`      FROM w      WHERE `state\n(linked to\nsummaries below)` = 'maine' ) SELECT DISTINCT CASE WHEN SUBSTR(`candidates`, INSTR(`candidates`, '(') + 1, 3) NOT IN ('dem', 'rep') THEN SUBSTR(`candidates`, INSTR(`candidates`, '(') + 1, 3) ELSE NULL END AS other_party  FROM maine_candidates;
Executing on table_id 43 ('w43'): SELECT `candidates` FROM w WHERE `state\n(linked to\nsummaries below)` = 'maine';
Executing on table_id 43 ('w43'): SELECT DISTINCT TRIM(LOWER(SUBSTR(`candidates`, 1, 1))) AS party FROM w WHERE `state\n(linked to\nsummaries below)` = 'maine' AND `candidates` NOT LIKE '%r%' AND `candidates` NOT LIKE '%d%';
Executing on table_id 44 ('w44'): WITH MaxWins AS (     SELECT MAX(`total wins`) AS max_wins FROM w ) SELECT `season`, `total wins` FROM w WHERE `total wins` = (SELECT max_wins FROM MaxWins);
Executing on table_id 44 ('w44'): SELECT `season` FROM w WHERE `total wins` = (SELECT MAX(`total wins`) FROM w);
Executing on table_id 44 ('w44'): WITH MaxWins AS (     SELECT MAX(`total wins`) AS max_wins FROM w ) SELECT `season`, `total wins` FROM w WHERE `total wins` = (SELECT max_wins FROM MaxWins);
Executing on table_id 45 ('w45'): SELECT SUM(`1939/40`) AS total_deaths_1939_1940 FROM w WHERE `description losses` != 'total';
Executing on table_id 45 ('w45'): SELECT SUM(`1939/40`) AS total_deaths_1939_1940 FROM w WHERE `description losses` != 'total';
Executing on table_id 45 ('w45'): SELECT SUM(`1939/40`) AS total_deaths_1939_1940  FROM (SELECT `1939/40`        FROM w        EXCEPT        SELECT `1939/40`        FROM w        WHERE `description losses` = 'total') AS subquery;
Executing on table_id 46 ('w46'): SELECT COUNT(DISTINCT `model`) AS total_models FROM w;
Executing on table_id 46 ('w46'): SELECT COUNT(DISTINCT `model`) AS total_models FROM w;
Executing on table_id 46 ('w46'): SELECT COUNT(DISTINCT model) AS total_models FROM w;
Executing on table_id 47 ('w47'): SELECT COUNT(*) AS num_wins FROM w WHERE `winning vehicle (ta1)` = 'jaguar xjs';
Executing on table_id 47 ('w47'): SELECT COUNT(*) AS num_wins_by_jaguar_xjs  FROM w  WHERE `winning vehicle (ta1)` = 'jaguar xjs'     OR `winning vehicle (ta2)` = 'jaguar xjs';
Executing on table_id 47 ('w47'): SELECT COUNT(*) AS num_wins FROM w WHERE `winning vehicle (ta1)` = 'jaguar xjs';
Executing on table_id 49 ('w49'): WITH millwall_games AS (     SELECT          *,         LAG(opponents) OVER (ORDER BY ROW_ID) AS prev_opponent     FROM          w ), consecutive_millwall_games AS (     SELECT          CASE              WHEN opponents = 'millwall' AND prev_opponent = 'millwall' THEN 1              ELSE 0          END AS is_consecutive     FROM          millwall_games ) SELECT      SUM(is_consecutive) AS consecutive_games_against_millwall FROM      consecutive_millwall_games;
Executing on table_id 49 ('w49'): SELECT COUNT(*) AS consecutive_games  FROM (   SELECT w1.*, w2.*   FROM w AS w1   JOIN w AS w2 ON DATE(w1.date) + INTERVAL 1 DAY = DATE(w2.date)   WHERE w1.`opponents` = 'millwall' AND w2.`opponents` = 'millwall' );
Executing on table_id 50 ('w50'): SELECT `team` FROM w WHERE `position` = '23rd' AND `team` != 'angola racing team';
Executing on table_id 50 ('w50'): SELECT `team`  FROM (SELECT * FROM w WHERE `position` = '23rd') AS subquery  WHERE `team` != 'angola racing team';
Executing on table_id 50 ('w50'): SELECT `team` FROM w WHERE `position` = '23rd' AND `team` != 'angola racing team';
Executing on table_id 52 ('w52'): SELECT `target city/market`, `city of license` FROM w WHERE `name` LIKE '%the wolf%';

/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')

[   alert_name  backspace_name
0  bell (bel)  backspace (bs),   unicode name    unicode name
0   bell (bel)  backspace (bs)]

/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:259: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  combined_df = pd.concat(non_empty_dfs, ignore_index=True)
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')

[  result
0     No,                                          via
0  hainault barkingside, gants hill , ilford
1     woodford green, snaresbrook , wanstead,   result result
0     No     No]

/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')

[   year       playoffs  prev_playoffs
0  1976  league champs  league champs,           manager  year  year
0  roy hartsfield  1975  1976,    first_year  second_year
0        1975         1976]

/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')

In [13]:
## step 8: SQP parse aggregate
processed_table = {} ## processed_table包括了inference LLM后所有结果的聚合,key 与 method_key 保持一致
processed_table['Base'] = wikitq_df_processed
processed_table['Select_Row'] = filtered_tables_row
processed_table['Select_Column'] = filtered_tables
processed_table['RAG_20_5'] = RAG_20_5
processed_table['Execute_SQL'] = sql_exec_df_output ## SQL聚合结果！
processed_table['Execute_SQL_count'] = sql_executable_count ## SQL单个结果，用作 CrossEncoder 跨模态查询

In [15]:
## step 8: SQP parse aggregate
np.save(f'{tmp_save_path}/processed_table.npy',processed_table)

In [40]:
processed_table = np.load(f'{tmp_save_path}/processed_table.npy',allow_pickle=True).item()

- Run Check Model

In [14]:
## Step 9: generated check model data 
# 对每一条数据，维护一个 Sequence_Operator
# 每条数据应该对应一个 Dict,这个Dict 包含了3 个参数：
    # id: index
    # Sequence: Operator Sequence
    # Terminated: True/False
    # Check Score: CrossEncoder 分数
    # Check Status: True/False,当前是否被计算
# 对每条数据，如果 Terminated = True，则不参与计算
# 对应的，如果 Terminated = False，那么查看 Check Status,如果 Statue=False，那么计算 Check_Score
# 每一轮计算之后，Check_Score 更新，Check Statue更新，该轮开始判定，用一个 threshold
# 如果 Check Status = True, Check Score >= Threshold，那么标注 Terminated = True，当前路径被接收
# 如果 Check Status = True, Check Score < Threshold，那么Terminated = False, Check Status = False, Check Score 清空
# Check Score 触发 RollBack 机制，即除了‘Execute_SQL'外，Extract 回退，重新计算当前流程
# 如果当前操作符只有'Execute_SQL’和空（所有 RollBack 均未被接收），那么触发 FORWARD,Terminated  = True，强制修改 Operator Sequence 为['Execute_SQL']
Check_Model_Data_Sequence = {}
for key in ranked_result.keys(): ## 遍历所有数据,初始化
    start_sequence = ranked_result[key]
    Check_Model_Data_Sequence[key] = {}
    Check_Model_Data_Sequence[key]['id'] = key
    Check_Model_Data_Sequence[key]['Sequence'] = start_sequence
    if start_sequence == ['Base'] or start_sequence == ['Execute_SQL']: ## Terminated 不参与计算
        Check_Model_Data_Sequence[key]['Terminated'] = True
        Check_Model_Data_Sequence[key]['Check_Status'] = False
        Check_Model_Data_Sequence[key]['Check_Score'] = 0.0
    else:
        Check_Model_Data_Sequence[key]['Terminated'] = False
        Check_Model_Data_Sequence[key]['Check_Status'] = False
        Check_Model_Data_Sequence[key]['Check_Score'] = 0.0
# Check_Model_Data_Sequence[4]
for key in Check_Model_Data_Sequence.keys():
    data_entry = Prepare_Data_for_Operator_Sequence(key,Check_Model_Data_Sequence[key]['Sequence'],dataset, processed_table)
    Check_Model_Data_Sequence[key]['data_entry'] = data_entry
## Check

- load ReRanking Model

In [15]:
## step 9 load rerank model
reranker_model = FlagReranker(check_moedl_path, use_fp16=True)

In [16]:
## step 9: iterative check
check_tau = check_tau
for loop in range(3):
    updated_data = batch_rerank_scores(reranker_model, Check_Model_Data_Sequence, batch_size=16)
    Check_Model_Data_Sequence = updated_data
    ## Check Terminal Status
    for key in Check_Model_Data_Sequence.keys():
        if Check_Model_Data_Sequence[key]['Terminated'] == True:
            continue
        else:
            if Check_Model_Data_Sequence[key]['Check_Status'] == True:
                if Check_Model_Data_Sequence[key]['Check_Score'] >= check_tau: ## 0.5 threshold
                    Check_Model_Data_Sequence[key]['Terminated'] = True
                else:
                    Check_Model_Data_Sequence[key]['Terminated'] = False
                    Check_Model_Data_Sequence[key]['Check_Status'] = False
                    Check_Model_Data_Sequence[key]['Check_Score'] = 0.0
                    current_sequence = Check_Model_Data_Sequence[key]['Sequence']
                    ROLLBACK_seq, terminated_flag = ROLLBACK(current_sequence)
                    Check_Model_Data_Sequence[key]['Sequence'] = ROLLBACK_seq
                    Check_Model_Data_Sequence[key]['Terminated'] = terminated_flag
                    if terminated_flag == False:
                        data_entry = Prepare_Data_for_Operator_Sequence(key,ROLLBACK_seq,dataset, processed_table)
                        Check_Model_Data_Sequence[key]['data_entry'] = data_entry
            else:
                raise ValueError("Check Status should be True when Terminated is False after reranking.")

Filtering items to rerank (Terminated=False and data_entry exists)...
Computing scores for 862 items with batch size 16...

initial target device:   0%|          | 0/2 [00:00<?, ?it/s]/home/aizoo/miniconda3/envs/hstar/lib/python3.9/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
initial target device:  50%|█████     | 1/2 [00:05<00:05,  5.53s/it]/home/aizoo/miniconda3/envs/hstar/lib/python3.9/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
initial target device: 100%|██████████| 2/2 [00:13<00:00,  6.77s/it]
pre tokenize:   0%|          | 0/27 [00:00<?, ?it/s]You're using a XLMRobertaTokenizerFast tokenizer. Please note that with a fast tokenizer, using the `__call__` method is faster than using a method to encode the text followed by a call to the `pad` method to get a padded encoding.
pre tokenize: 100%|██████████| 27/27 [00:00<00:00, 47.64it/s]
pre tokenize:   0%|          | 0/27 [00:00<?, ?it/s]You're using a XLMRobertaTokenizerFast tokenizer. Please note that with a fast tokenizer, using the `__call__` method is faster than using a method to encode the text followed by a call to the `pad` method to get a padded encoding.
pre tokenize: 100%|██████████| 27/27 [00:00<00:00, 67.67it/s]s]
Compute Scores: 100%|██████████| 27/27 [00:00<00:00, 30.46it/s]
Compute Scores: 100%|██████████| 27/27 [00:00<00:00, 29.95it/s]
Chunks: 100%|██████████| 2/2 [00:04<00:00,  2.28s/it]

Updating scores in the original dictionary...
Reranking complete.
Filtering items to rerank (Terminated=False and data_entry exists)...
Computing scores for 115 items with batch size 16...

pre tokenize: 100%|██████████| 4/4 [00:00<00:00, 129.82it/s]
pre tokenize: 100%|██████████| 4/4 [00:00<00:00, 51.17it/s]
Compute Scores: 100%|██████████| 4/4 [00:00<00:00, 27.99it/s]
Compute Scores: 100%|██████████| 4/4 [00:00<00:00, 26.01it/s]
Chunks: 100%|██████████| 2/2 [00:00<00:00,  7.66it/s]

Updating scores in the original dictionary...
Reranking complete.
Filtering items to rerank (Terminated=False and data_entry exists)...
No items to process.

In [17]:
## step 9 load rerank model
reranker_model = FlagReranker(check_moedl_path, use_fp16=True)

### Check Additional Execute SQL and Execute

In [18]:
## step 10: add missing SQL
SQL_list_final = []
for index in range(len(dataset)):
    sequence = Check_Model_Data_Sequence[index]['Sequence']
    if sequence==[] or sequence.__contains__('Execute_SQL'):
        SQL_list_final.append(index)
add_sql_list = list(set(SQL_list_final) - set(LLM_query_list['Execute_SQL']['index']))
add_sql_query_list = []
for index in add_sql_list:
    prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/sql_reason_wtq.txt',processed=True)
    add_sql_query_list.extend([prompt])
# add_sql_response_list = response_vllm(llm,add_sql_query_list, sample_num=3)
add_sql_response_list = infer_prompts(add_sql_query_list, sample_num=3, temperature=0.7, top_p=0.8,llm_path=llm_path)[0]

Processed prompts: 100%|██████████| 6/6 [00:12<00:00,  2.09s/it, est. speed input=1901.46 toks/s, output=362.62 toks/s]

In [19]:
### step 10: add sql parse and execute
from tqdm.notebook import tqdm
sample_num = 3
sql_exec_df = {}
valid_parse = 0
warning_list = []
sql_executable_count = []
# exec_sql_index_list = LLM_query_list['Execute_SQL']['index']
# exec_sql_response_list = LLM_query_list['Execute_SQL']['response']
# for index in tqdm(range(len(wikitq_df_processed))):
for i in range(len(add_sql_list)):
    index = add_sql_list[i]
    sql_exec_df[index] = []
    for sample_ind in range(sample_num):
        
        # original_text = eval(wikitq_df_output.iloc[index,-1])[sample_ind]
        original_text = add_sql_response_list[i][sample_ind]
        sql = fix_sql_query(response_text=original_text,table_df=wikitq_df_processed[index],table_title=table_titles[index])
        if [index,sample_ind] in warning_list:
            sql = ''
            print(index,sample_ind)
        if sql!='':
            # print(result)
            try:
                result = executor.sql_exec(sql.replace('``','`'), db, table_id=index,add_row_id = True)
                df = pd.DataFrame(result['rows'],columns=result['header'])
            except:
                df = pd.DataFrame()
        else:
            df = pd.DataFrame()
        sql_exec_df[index].append(df)
        if(len(df)>0):
            valid_parse+=1
            sql_pair = {}
            sql_pair['id'] = index
            sql_pair['sample_ind'] = sample_ind
            sql_pair['sql'] = sql
            sql_pair['table'] = df
            sql_executable_count.append(sql_pair)
sql_exec_df_output_new = merge_clean_and_format_df_dict(sql_exec_df)
    # print(original_text)
for index in sql_exec_df_output_new.keys():
    sql_exec_df_output[index] = sql_exec_df_output_new[index]
processed_table['Execute_SQL'] = sql_exec_df_output

Executing on table_id 2018 ('w2018'): WITH ranked_designers AS (     SELECT          year,         designer(s) AS current_designer,         LAG(designer(s)) OVER (ORDER BY year) AS previous_designer     FROM          w ) SELECT DISTINCT      current_year.year AS year_1,      current_year.current_designer,      next_year.year AS year_2,      next_year.previous_designer FROM      ranked_designers AS current_year JOIN      ranked_designers AS next_year ON current_year.year = next_year.year - 1 WHERE      current_year.current_designer = next_year.previous_designer;
Executing on table_id 2018 ('w2018'): SELECT w1.year, w1.`designer(s)`, w2.`designer(s)`  FROM w AS w1  JOIN w AS w2  ON w1.year + 1 = w2.year  AND w1.`designer(s)` = w2.`designer(s)`;
Executing on table_id 2700 ('w2700'): SELECT city, passengers FROM w WHERE city != 'quintana roo, cancún' ORDER BY passengers DESC LIMIT 1;
Executing on table_id 2700 ('w2700'): SELECT city, passengers FROM w WHERE city != 'quintana roo, cancún' ORDER BY passengers DESC LIMIT 1;
Executing on table_id 2700 ('w2700'): SELECT city, passengers FROM (SELECT * FROM w WHERE city != 'quintana roo, cancún') ORDER BY passengers DESC LIMIT 1;
Executing on table_id 365 ('w365'): ABS((SELECT released FROM w WHERE disc/song = 'sweet child o''mine' LIMIT 1) - (SELECT released FROM w WHERE disc/song = 'nightrain' LIMIT 1));
Executing on table_id 365 ('w365'): WITH sweet_child_o_mine_released AS (     SELECT released FROM w WHERE disc/song = 'sweet child o''mine' ), nightrain_released AS (     SELECT released FROM w WHERE disc/song = 'nightrain' ) SELECT abs(T2.released - T1.released) AS time_difference_years  FROM sweet_child_o_mine_released AS T1  JOIN nightrain_released AS T2 ON 1=1;
Executing on table_id 365 ('w365'): WITH sweet_child_o_mine_released AS (SELECT released FROM w WHERE disc/song = 'sweet child o''mine'),      nightrain_released AS (SELECT released FROM w WHERE disc/song = 'nightrain') SELECT abs(T2.released - T1.released) AS time_difference_years FROM sweet_child_o_mine_released AS T1, nightrain_released AS T2;
Executing on table_id 2359 ('w2359'): SELECT LENGTH(`nickname`) > 10 AS has_more_than_10_letters FROM w WHERE `num` = 8;
Executing on table_id 2359 ('w2359'): SELECT LENGTH(`nickname`) > 10 AS has_more_than_10_letters FROM w WHERE `num` = 8;
Executing on table_id 2359 ('w2359'): SELECT LENGTH(nickname) > 10 AS has_more_than_10_letters  FROM w  WHERE num = 8;
Executing on table_id 2552 ('w2552'): WITH relevant_terms AS (     SELECT *, (`term end` - `term start`) AS duration      FROM w      WHERE `name\n(birth–death)\n(title)` LIKE '%penn nouth%' OR `name\n(birth–death)\n(title)` LIKE '%sisowath monireth%' ) SELECT `name\n(birth–death)\n(title)`, MAX(duration)  FROM relevant_terms GROUP BY `name\n(birth–death)\n(title)` ORDER BY MAX(duration) DESC LIMIT 1;
Executing on table_id 2552 ('w2552'): plaintext SQL:  SELECT      `name\n(birth–death)\n(title)`,      strftime('%J', `term end`) - strftime('%J', `term start`) AS days_in_office FROM w WHERE `name\n(birth–death)\n(title)` LIKE '%samdech penn%' OR `name\n(birth–death)\n(title)` LIKE '%sisowath monireth%' ORDER BY days_in_office DESC LIMIT 1;
Executing on table_id 2552 ('w2552'): WITH relevant_rows AS (;
Executing on table_id 2199 ('w2199'): SELECT COUNT(*) AS num_other_routes  FROM w  WHERE `operator` = (SELECT `operator` FROM w WHERE `route number` = '66')  AND `route number` != '66';
Executing on table_id 2199 ('w2199'): SELECT COUNT(*) - 1 AS num_other_routes FROM w WHERE `operator` = (SELECT operator FROM w WHERE `route number` = '66');
Executing on table_id 2199 ('w2199'): SELECT COUNT(*) - 1 AS num_other_routes  FROM w  WHERE operator = (SELECT operator FROM w WHERE `route number` = '66');

/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:294: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')

In [20]:
np.save(f'{tmp_save_path}/Check_Model_Data_Sequence.npy',Check_Model_Data_Sequence)

In [21]:
## step 8: SQP parse aggregate
np.save(f'{tmp_save_path}/processed_table.npy',processed_table)

In [5]:
Check_Model_Data_Sequence = np.load(f'{tmp_save_path}/Check_Model_Data_Sequence.npy',allow_pickle=True).item()

In [6]:
processed_table = np.load('datasets/schedule_test/wikitq_train_free/processed_table.npy',allow_pickle=True).item()

In [22]:
## step 11: generate QA result
prompt_list = []
for index in range(len(dataset)):
    sequence = Check_Model_Data_Sequence[index]['Sequence']
    prompt = build_wikitq_prompt_from_df(dataset,Check_Model_Data_Sequence[index]['data_entry']['table'],index,template_path='../prompts/text_reason_wtq.txt',processed=True)
    if sequence==[] or sequence.__contains__('Execute_SQL'):
        # try:
        evidence = table_to_str_sql(processed_table['Execute_SQL'][index])
        prompt = prompt + evidence
    prompt_list.append(prompt)
# wikitq_df['instruction'] = prompt_list

In [23]:
## step 11: execute QA
# qa_final = response_vllm(llm,prompt_list, sample_num=1)
qa_final = infer_prompts(prompt_list,temperature=0, top_p=1, sample_num=1,llm_path=llm_path)
wikitq_df = pd.DataFrame(dataset)
wikitq_df['instruction'] = prompt_list
wikitq_df['predict'] = qa_final[0]
## step 12: evaluate
wikitq_df['predict'] = [str(s) for s in qa_final[0]]
acc_all, error_index_all, format_error_index_all = evaluate_predictions(dataset_name, wikitq_df, dataset)

Processed prompts: 100%|██████████| 4344/4344 [06:05<00:00, 11.88it/s, est. speed input=26306.47 toks/s, output=1187.33 toks/s]

  0%|          | 0/4344 [00:00<?, ?it/s]

Correct Samples: 2860; Total Samples: 4344
Accuracy: 65.84

In [58]:
wikitq_df = pd.DataFrame(dataset).iloc[:100]
wikitq_df['instruction'] = prompt_list
wikitq_df['predict'] = qa_final[0]
## step 12: evaluate
wikitq_df['predict'] = [str(s) for s in qa_final[0]]
acc_all, error_index_all, format_error_index_all = evaluate_predictions(dataset_name, wikitq_df, dataset)

  0%|          | 0/100 [00:00<?, ?it/s]

Correct Samples: 80; Total Samples: 100
Accuracy: 80.00

In [28]:
wikitq_df.to_csv('wikitq_test_result_30B.csv')

In [39]:
acc_all, error_index_all, format_error_index_all = evaluate_predictions(dataset_name, wikitq_df.iloc[:100], dataset)

  0%|          | 0/100 [00:00<?, ?it/s]

Correct Samples: 82; Total Samples: 100
Accuracy: 82.00

In [46]:
## step 11: execute QA
qa_final = response_vllm(llm,prompt_list, sample_num=1)
qa_final = 
wikitq_df = pd.DataFrame(dataset)
wikitq_df['instruction'] = prompt_list
wikitq_df['predict'] = qa_final

Formatting Prompts:   0%|          | 0/4344 [00:00<?, ?it/s]

Adding requests:   0%|          | 0/4344 [00:00<?, ?it/s]

Processed prompts:   0%|          | 0/4344 [00:00<?, ?it/s, est. speed input: 0.00 toks/s, output: 0.00 toks/s…

Processing Outputs:   0%|          | 0/4344 [00:00<?, ?it/s]

In [47]:
## step 12: evaluate
wikitq_df['predict'] = [str(s) for s in qa_final]
acc_all, error_index_all, format_error_index_all = evaluate_predictions(dataset_name, wikitq_df, dataset)

  0%|          | 0/4344 [00:00<?, ?it/s]

Correct Samples: 2847; Total Samples: 4344
Accuracy: 65.54

In [9]:
## step 11: execute QA
# qa_final = response_vllm(llm,prompt_list, sample_num=1)
qa_final = infer_prompts(prompt_list,temperature=0, top_p=1, sample_num=1,llm_path = llm_path)
wikitq_df = pd.DataFrame(dataset)
wikitq_df['instruction'] = prompt_list
wikitq_df['predict'] = qa_final[0]
## step 12: evaluate
wikitq_df['predict'] = [str(s) for s in qa_final[0]]
acc_all, error_index_all, format_error_index_all = evaluate_predictions(dataset_name, wikitq_df, dataset)

Processed prompts:  17%|█▋        | 723/4344 [01:36<08:03,  7.48it/s, est. speed input=15665.28 toks/s, output=1542.73 toks/s]

KeyboardInterrupt: